#include "buttons.h"
#include <mik32_hwlibs/mik32_memory_map.h>
#include <mik32_hwlibs/power_manager.h>
#include <mik32_hwlibs/wakeup.h>
#include <mik32_hwlibs/gpio.h>
#include <mik32_hwlibs/pad_config.h>
#include <mik32_hwlibs/epic.h>
#include <mik32_hwlibs/timer32.h>
#include <mik32_hwlibs/csr.h>
#include <mik32_hwlibs/scr1_csr_encoding.h>
#include <mik32_hwlibs/scr1_timer.h>
#include <mik32_hwlibs/uart.h>
#include <mik32_hwlibs/analog_reg.h>

#include <runtime.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>


// отсчёты для косинуса, 4096/5 уровней для ЦАП, размещается в ОЗУ, чтобы доступ по времени был предсказуемым
// на случай LTO оптимизации, помещаем таблицу явно в секцию .data
// так как оптимизатор видит, что обращение к таблице только для чтения и помещает её
// в секцию констант, которая попадает в SPI Flash (если собирается для SPIFI)
__attribute((section(".data.g_cos_table_dac")))
int16_t g_cos_table_dac[1024] = {
  0, 3, 5, 8, 10, 13, 15, 18
, 20, 23, 25, 28, 30, 33, 35, 38
, 40, 43, 45, 48, 50, 53, 55, 58
, 60, 63, 65, 67, 70, 72, 75, 77
, 80, 82, 85, 87, 90, 92, 95, 97
, 99, 102, 104, 107, 109, 112, 114, 116
, 119, 121, 124, 126, 128, 131, 133, 135
, 138, 140, 143, 145, 147, 150, 152, 154
, 157, 159, 161, 164, 166, 168, 170, 173
, 175, 177, 179, 182, 184, 186, 188, 191
, 193, 195, 197, 200, 202, 204, 206, 208
, 210, 213, 215, 217, 219, 221, 223, 225
, 227, 229, 231, 234, 236, 238, 240, 242
, 244, 246, 248, 250, 252, 254, 256, 258
, 260, 262, 263, 265, 267, 269, 271, 273
, 275, 277, 279, 280, 282, 284, 286, 288
, 289, 291, 293, 295, 296, 298, 300, 302
, 303, 305, 307, 308, 310, 311, 313, 315
, 316, 318, 319, 321, 323, 324, 326, 327
, 329, 330, 332, 333, 335, 336, 337, 339
, 340, 342, 343, 344, 346, 347, 348, 350
, 351, 352, 354, 355, 356, 357, 358, 360
, 361, 362, 363, 364, 366, 367, 368, 369
, 370, 371, 372, 373, 374, 375, 376, 377
, 378, 379, 380, 381, 382, 383, 384, 384
, 385, 386, 387, 388, 389, 389, 390, 391
, 392, 392, 393, 394, 394, 395, 396, 396
, 397, 398, 398, 399, 399, 400, 400, 401
, 401, 402, 402, 403, 403, 404, 404, 404
, 405, 405, 405, 406, 406, 406, 407, 407
, 407, 407, 408, 408, 408, 408, 408, 409
, 409, 409, 409, 409, 409, 409, 409, 409
, 409, 409, 409, 409, 409, 409, 409, 409
, 409, 409, 408, 408, 408, 408, 408, 407
, 407, 407, 407, 406, 406, 406, 405, 405
, 405, 404, 404, 404, 403, 403, 402, 402
, 401, 401, 400, 400, 399, 399, 398, 398
, 397, 396, 396, 395, 394, 394, 393, 392
, 392, 391, 390, 389, 389, 388, 387, 386
, 385, 384, 384, 383, 382, 381, 380, 379
, 378, 377, 376, 375, 374, 373, 372, 371
, 370, 369, 368, 367, 366, 364, 363, 362
, 361, 360, 358, 357, 356, 355, 354, 352
, 351, 350, 348, 347, 346, 344, 343, 342
, 340, 339, 337, 336, 335, 333, 332, 330
, 329, 327, 326, 324, 323, 321, 319, 318
, 316, 315, 313, 311, 310, 308, 307, 305
, 303, 302, 300, 298, 296, 295, 293, 291
, 289, 288, 286, 284, 282, 280, 279, 277
, 275, 273, 271, 269, 267, 265, 263, 262
, 260, 258, 256, 254, 252, 250, 248, 246
, 244, 242, 240, 238, 236, 234, 231, 229
, 227, 225, 223, 221, 219, 217, 215, 213
, 210, 208, 206, 204, 202, 200, 197, 195
, 193, 191, 188, 186, 184, 182, 179, 177
, 175, 173, 170, 168, 166, 164, 161, 159
, 157, 154, 152, 150, 147, 145, 143, 140
, 138, 135, 133, 131, 128, 126, 124, 121
, 119, 116, 114, 112, 109, 107, 104, 102
, 99, 97, 95, 92, 90, 87, 85, 82
, 80, 77, 75, 72, 70, 67, 65, 63
, 60, 58, 55, 53, 50, 48, 45, 43
, 40, 38, 35, 33, 30, 28, 25, 23
, 20, 18, 15, 13, 10, 8, 5, 3
, 0, -3, -5, -8, -10, -13, -15, -18
, -20, -23, -25, -28, -30, -33, -35, -38
, -40, -43, -45, -48, -50, -53, -55, -58
, -60, -63, -65, -67, -70, -72, -75, -77
, -80, -82, -85, -87, -90, -92, -95, -97
, -99, -102, -104, -107, -109, -112, -114, -116
, -119, -121, -124, -126, -128, -131, -133, -135
, -138, -140, -143, -145, -147, -150, -152, -154
, -157, -159, -161, -164, -166, -168, -170, -173
, -175, -177, -179, -182, -184, -186, -188, -191
, -193, -195, -197, -200, -202, -204, -206, -208
, -210, -213, -215, -217, -219, -221, -223, -225
, -227, -229, -231, -234, -236, -238, -240, -242
, -244, -246, -248, -250, -252, -254, -256, -258
, -260, -262, -263, -265, -267, -269, -271, -273
, -275, -277, -279, -280, -282, -284, -286, -288
, -289, -291, -293, -295, -296, -298, -300, -302
, -303, -305, -307, -308, -310, -311, -313, -315
, -316, -318, -319, -321, -323, -324, -326, -327
, -329, -330, -332, -333, -335, -336, -337, -339
, -340, -342, -343, -344, -346, -347, -348, -350
, -351, -352, -354, -355, -356, -357, -358, -360
, -361, -362, -363, -364, -366, -367, -368, -369
, -370, -371, -372, -373, -374, -375, -376, -377
, -378, -379, -380, -381, -382, -383, -384, -384
, -385, -386, -387, -388, -389, -389, -390, -391
, -392, -392, -393, -394, -394, -395, -396, -396
, -397, -398, -398, -399, -399, -400, -400, -401
, -401, -402, -402, -403, -403, -404, -404, -404
, -405, -405, -405, -406, -406, -406, -407, -407
, -407, -407, -408, -408, -408, -408, -408, -409
, -409, -409, -409, -409, -409, -409, -409, -409
, -409, -409, -409, -409, -409, -409, -409, -409
, -409, -409, -408, -408, -408, -408, -408, -407
, -407, -407, -407, -406, -406, -406, -405, -405
, -405, -404, -404, -404, -403, -403, -402, -402
, -401, -401, -400, -400, -399, -399, -398, -398
, -397, -396, -396, -395, -394, -394, -393, -392
, -392, -391, -390, -389, -389, -388, -387, -386
, -385, -384, -384, -383, -382, -381, -380, -379
, -378, -377, -376, -375, -374, -373, -372, -371
, -370, -369, -368, -367, -366, -364, -363, -362
, -361, -360, -358, -357, -356, -355, -354, -352
, -351, -350, -348, -347, -346, -344, -343, -342
, -340, -339, -337, -336, -335, -333, -332, -330
, -329, -327, -326, -324, -323, -321, -319, -318
, -316, -315, -313, -311, -310, -308, -307, -305
, -303, -302, -300, -298, -296, -295, -293, -291
, -289, -288, -286, -284, -282, -280, -279, -277
, -275, -273, -271, -269, -267, -265, -263, -262
, -260, -258, -256, -254, -252, -250, -248, -246
, -244, -242, -240, -238, -236, -234, -231, -229
, -227, -225, -223, -221, -219, -217, -215, -213
, -210, -208, -206, -204, -202, -200, -197, -195
, -193, -191, -188, -186, -184, -182, -179, -177
, -175, -173, -170, -168, -166, -164, -161, -159
, -157, -154, -152, -150, -147, -145, -143, -140
, -138, -135, -133, -131, -128, -126, -124, -121
, -119, -116, -114, -112, -109, -107, -104, -102
, -99, -97, -95, -92, -90, -87, -85, -82
, -80, -77, -75, -72, -70, -67, -65, -63
, -60, -58, -55, -53, -50, -48, -45, -43
, -40, -38, -35, -33, -30, -28, -25, -23
, -20, -18, -15, -13, -10, -8, -5, -3
};


#define BUTTONS_COUNT   5

// DDS генераторы с опорной частотой 50 кГц
#define DDS_FREQ_0    21474837u // примерно 250 Гц
#define DDS_FREQ_1    35406020u // примерно 412.2 Гц
#define DDS_FREQ_2    58374657u // примерно 679.6 Гц
#define DDS_FREQ_3    96243538u // примерно 1120.4 Гц
#define DDS_FREQ_4   158678768u // примерно 1847.2 Гц

// порядкову номеру кнопки соответствует выбранная частота
static const uint32_t g_freq[BUTTONS_COUNT] = {
  DDS_FREQ_0
, DDS_FREQ_1
, DDS_FREQ_2
, DDS_FREQ_3
, DDS_FREQ_4
};

// "фазы" генераторов
uint32_t g_phase[BUTTONS_COUNT];
// отображение состояния кнопок - первые BUTTONS_COUNT битов - 1 если кнопка нажата
volatile uint32_t g_main_buttons = 0;


void process_init_mcu() {
  // фазы генераторов в ноль
  memset( g_phase, 0, sizeof(g_phase) );
  // включаем тактирование GPIO
  PM->CLK_APB_M_SET = PM_CLOCK_APB_M_PAD_CONFIG_M;
  PM->CLK_APB_P_SET = PM_CLOCK_APB_P_GPIO_2_M;
  // PORT2.7 - GPIO
  PAD_CONFIG->PORT_2_CFG = (PAD_CONFIG->PORT_2_CFG & ~(PAD_CONFIG_PIN_M(7)));
  PAD_CONFIG->PORT_2_DS = (PAD_CONFIG->PORT_2_DS & ~(PAD_CONFIG_PIN_M(7)))
                        | PAD_CONFIG_PIN(7, 2)
                        ;
  // PORT2.7 выход (на плате ACE-UNO к этому выводу подключен светодиод)
  GPIO_2->DIRECTION_OUT = (1 << 7);
  GPIO_2->CLEAR = (1 << 7); // светодиод выключен
  // включаем тактирование TIMER32_0 и EPIC
  PM->CLK_APB_M_SET = PM_CLOCK_APB_M_TIMER32_0_M | PM_CLOCK_APB_M_EPIC_M;
  // выбираем истоником тактового сигнала для TIMER32_0 системную частоту
  PM->TIMER_CFG = (PM->TIMER_CFG & ~(PM_TIMER_CFG_MUX_TIMER_M(0)));
  // настройка TIMER32_0
  TIMER32_0->ENABLE = TIMER32_ENABLE_TIM_CLR_M;
  TIMER32_0->TOP = 639; // отсчёт 640 тактов (50 кГц)
  TIMER32_0->PRESCALER = 0; // /1
  TIMER32_0->CONTROL = 0;
  TIMER32_0->INT_MASK = 0;
  TIMER32_0->INT_CLEAR = 0xFFFFFFFF;
  TIMER32_0->ENABLE = TIMER32_ENABLE_TIM_EN_M;
  // разрешаем прерывания по переполнению
  TIMER32_0->INT_MASK = TIMER32_INT_OVERFLOW_M;
  // разрешаем прерывание от TIMER32_0
  EPIC->MASK_LEVEL_SET = EPIC_LINE_M(EPIC_LINE_TIMER32_0_S);
  // разрешаем прерывания вообще
  set_csr(mstatus, MSTATUS_MIE);
  set_csr(mie, MIE_MEIE);
  // DAC
  PM->CLK_APB_P_SET = PM_CLOCK_APB_P_ANALOG_REGS_M;
  // типа выставляем бит включения и убираем "сигнал сброса"
  ANALOG_REG->DAC0.CFG = DAC_CFG_EN_M | DAC_CFG_RN_M;
  ANALOG_REG->DAC1.CFG = DAC_CFG_EN_M | DAC_CFG_RN_M;
  // конфигурируем выходы PORT1.12 и PORT1.13, аналоговый, "подтяжки" отключены
  PM->CLK_APB_P_SET = PM_CLOCK_APB_P_GPIO_1_M;
  PAD_CONFIG->PORT_1_CFG |= (PAD_CONFIG->PORT_1_CFG & ~(PAD_CONFIG_PIN_M(12) | PAD_CONFIG_PIN_M(13)))
                         | PAD_CONFIG_PIN_M(12)
                         | PAD_CONFIG_PIN_M(13)
                         ;
  PAD_CONFIG->PORT_1_PUPD = (PAD_CONFIG->PORT_1_PUPD & ~(PAD_CONFIG_PIN_M(12) | PAD_CONFIG_PIN_M(13)));
}


// точка входа
void main() {
  //
  buttons_init();
  // таймер (TIMER32_0) настроен на прерывания с частотой 50 кГц
  // в обработчике прерывания заносится очередное значение в регистры DAC.VALUE
  // в спецификации указано, что максимальное время установления значения 0.7 мкс,
  // так что на бит готовности DAC.CFG.EMPTY_READ не смотрим
  // на выходе DAC0 смесь частот в зависимости от "нажатых кнопок"
  // на выходе DAC1 - "инвертированное" значение от DAC0
  // нажатие на кнопку инвертирует бит, равный порядковому номеру кнопки
  // в переменной g_main_buttons (включает/выключает вывод соответствующей частоты) 
  for ( unsigned int k = 0;; ++k) {
    // порядок работы с кнопками именно такой:
    // вызвать buttons_scan(), затем получить состояния кнопок и признаки нажатия,
    // затем это всё обработать
    //
    // "сканирование" кнопок
    buttons_scan();
    // сосотояние кнопок
    uint32_t v_buttons = get_buttons_state();
    // признаки нажатия кнопок
    uint32_t v_changed = get_changed_buttons();
    //
    for ( int i = 0; i < BUTTONS_COUNT; ++i ) {
      // если кнопка изменила состояние и она нажата
      if ( 0 != (v_changed & g_buttons_masks[i]) && 0 == (v_buttons & g_buttons_masks[i]) ) {
        // инвертируем бит с порядковым номером кнопки в g_main_buttons
        g_main_buttons ^= (1u << i);
      }
    }
    // задержка обеспечивает период "опроса" кнопок примерно 500 раз в секунду
    delay_ms( 2u );
    // мигаем светодиодом
    if ( 0 == (k % 256) ) {
      GPIO_2->OUTPUT ^= (1 << 7);
    }
  }
}


// обработка прерываний, эта функция вызывается из обработчика прерываний в libbaremetal/src/libc/runtime.c
// располагаем в ОЗУ, чтобы чтение из флэша не вносило задержек
__attribute__ ((section(".ram_text")))
bool process_irqs(void) {
  // TIMER32_0
  if ( 0 != (EPIC->RAW_STATUS & EPIC_LINE_M(EPIC_LINE_TIMER32_0_S)) ) {
    // сразу заряжаем следующее преобразование (индекс в таблице отсчётов - старшие 10 бит счётчика "фазы")
    uint32_t v_btn = g_main_buttons;
    int32_t v_dac_value = 0;
    for ( int i = 0; i < BUTTONS_COUNT; ++i ) {
      if ( 0 != (v_btn & 1u) ) {
        v_dac_value += g_cos_table_dac[g_phase[i] >> 22];
      }
      g_phase[i] += g_freq[i];
      v_btn >>= 1;
    }
    // получаем "беззнаковое" значение для ЦАП
    v_dac_value += 2048;
    // вывод прямого и инвертированного значений
    ANALOG_REG->DAC0.VALUE = v_dac_value;
    ANALOG_REG->DAC1.VALUE = 4095 - v_dac_value;
    // сбрасываем флаги прерываний таймера
    TIMER32_0->INT_CLEAR = 0xFFFFFFFF;
    // сбрасываем флаг ожидающего прерывания от TIMER32_0
    EPIC->CLEAR = EPIC_LINE_M(EPIC_LINE_TIMER32_0_S);
    return true;
  } else {
    return false;
  }
}
